[
    {
        "id": "a1b2c3d4e5",
        "image": "https://i.ibb.co/bNGhYK8/Rectangle-2-2.png",
        "courseName": "Introduction to C Programming",
        "description": "This comprehensive course provides an in-depth introduction to the C programming language. C is a versatile and widely used language, known for its efficiency and low-level programming capabilities. Whether you are a beginner or have some programming experience, this course will guide you through the fundamental concepts of C. You will learn about variables, data types, control structures, functions, and memory management. Practical examples and hands-on coding exercises will reinforce your understanding. By the end of the course, you will be well-prepared to write C programs for various applications.",
        "price": 50,
        "credit": 5
    },
    {
        "id": "b2c3d4e5f6",
        "image": "https://i.ibb.co/PzDQHmq/Rectangle-2-3.png",
        "courseName": "Introduction to Algorithms",
        "description": "Algorithms are at the core of computer science and play a crucial role in solving complex problems efficiently. This course offers a comprehensive introduction to algorithms, covering a wide range of topics, including sorting, searching, data structures, and algorithm analysis. You will gain a deep understanding of algorithm design paradigms and problem-solving techniques. Through practical exercises and algorithmic challenges, you will apply your knowledge and develop problem-solving skills. This course is essential for anyone looking to excel in software development, data science, or competitive programming.",
        "price": 80,
        "credit": 8
    },
    {
        "id": "c3d4e5f6g7",
        "image": "https://i.ibb.co/r0yBPz8/Rectangle-2-4.png",
        "courseName": "Introduction to C++ for DSA",
        "description": "C++ is a powerful programming language known for its performance and versatility. In this course, we focus on using C++ specifically for Data Structures and Algorithms (DSA). You will learn how to leverage C++ features to implement common data structures like arrays, linked lists, stacks, and queues. Additionally, we'll delve into algorithm design and analysis, exploring efficient solutions to various computational problems. By the end of the course, you'll have a strong foundation in C++ and be well-equipped to tackle algorithmic challenges.",
        "price": 60,
        "credit": 6
    },
    {
        "id": "d4e5f6g7h8",
        "image": "https://i.ibb.co/YyPjJth/Rectangle-3.png",
        "courseName": "Basic Data Structures",
        "description": "Data structures are the building blocks of computer programs, enabling efficient storage and retrieval of data. This course provides a comprehensive overview of basic data structures such as arrays, linked lists, stacks, and queues. You will learn how to implement these data structures from scratch and gain insights into their real-world applications. Additionally, we will cover essential algorithms for sorting and searching. Whether you are a beginner or looking to refresh your knowledge, this course is an excellent starting point for anyone interested in computer science or software development.",
        "price": 100,
        "credit": 10
    },
    {
        "id": "e5f6g7h8i9",
        "image": "https://i.ibb.co/1ZWzPH4/Rectangle-2.png",
        "courseName": "Introduction to OOP Python",
        "description": "Object-Oriented Programming (OOP) is a fundamental paradigm in software development. Python, with its simplicity and versatility, is an excellent language to learn OOP concepts. In this course, you will explore the principles of OOP, including classes, objects, inheritance, and polymorphism, using Python as your programming language. Hands-on projects and coding exercises will help you apply OOP concepts to real-world scenarios. By the end of the course, you will be proficient in using Python for object-oriented programming and be ready to tackle more advanced topics.",
        "price": 70,
        "credit": 7
    },
    {
        "id": "f6g7h8i9j0",
        "image": "https://i.ibb.co/L0k1Ljt/Rectangle-2-5.png",
        "courseName": "Software Engineering",
        "description": "Software engineering is the disciplined approach to designing, developing, and maintaining software systems. This comprehensive course covers all aspects of software engineering, from requirements analysis to testing and maintenance. You will learn industry best practices, software development methodologies, and tools used by professional software engineers. Practical projects and case studies will give you hands-on experience in building robust and scalable software. Whether you are aspiring to be a software engineer or want to enhance your skills, this course is your gateway to the world of software development.",
        "price": 90,
        "credit": 9
    },
    {
        "id": "g7h8i9j0k1",
        "image": "https://i.ibb.co/BKJWrsH/Rectangle-3-1.png",
        "courseName": "AWS, Cloud Computing",
        "description": "Cloud computing has revolutionized the way organizations manage their IT infrastructure and services. Amazon Web Services (AWS) is a leading cloud platform offering a wide range of cloud services. This course introduces you to AWS and cloud computing concepts. You will learn how to deploy and manage applications in the cloud, scale resources as needed, and ensure security and reliability. Hands-on labs and real-world examples will prepare you to work with AWS in a professional setting. Whether you are an IT professional or a developer, this course will equip you with valuable cloud computing skills.",
        "price": 60,
        "credit": 6
    },
    {
        "id": "h8i9j0k1l2",
        "image": "https://i.ibb.co/ynyR9w4/Rectangle-2-1.png",
        "courseName": "Database (MySQL)",
        "description": "Databases are at the heart of data storage and retrieval in software applications. MySQL is one of the most popular relational database management systems. This course provides a comprehensive introduction to MySQL database management. You will learn how to design, create, and manage databases, write SQL queries to retrieve and manipulate data, and ensure data integrity. Practical exercises and database projects will reinforce your skills. Whether you are a developer, database administrator, or IT professional, this course is essential for anyone working with databases.",
        "price": 80,
        "credit": 8
    },
    {
        "id": "i9j0k1l2m3",
        "image": "https://i.ibb.co/TYtMXp0/Rectangle-2-6.png",
        "courseName": "Problem Solving",
        "description": "Effective problem-solving is a critical skill in the world of technology and beyond. This course is designed to enhance your problem-solving abilities through coding challenges, logical puzzles, and real-world scenarios. You will learn systematic approaches to problem-solving, algorithmic thinking, and optimization techniques. Each module presents a variety of challenges to test your problem-solving skills. Whether you are preparing for technical interviews, coding competitions, or simply want to become a better problem solver, this course is your key to success.",
        "price": 70,
        "credit": 7
    }
]
